export const questions = [
    {
        title: "React в основном используется для создания ___.",
        variants: ['Базы данных', 'Пользовательского интерфейса', 'Платформы дизайна', 'Соединений'],
        correct: 1,
    },
    {
        title: "Для чего используется хук 'useState' в React?",
        variants: ['Для связывания состояния между компонентами', 'Для хранения данных в локальном хранилище браузера', 'Функция для использования статических переменных', 'Для управления состоянием в функциональных компонентах'],
        correct: 3,
    },
    {
        title: "Что такое компонент высшего порядка в React?",
        variants: ['Компонент со своим собственным состоянием', 'Компонент, который рендерит другие компоненты', 'Компонент с более высоким z-index', 'Компонент с функциями высшего порядка'],
        correct: 1,
    },
    {
        title: "Где правильно выведется компонент Test через рендер?",
        variants: ['<Test>', '</ Test>', '<Test />', 'Test'],
        correct: 2,
    },
    {
        title: "Чем свойства отличаются от состояний?",
        variants: ['Состояния можно изменять, свойства нельзя', 'Состояния для работы со значениями, свойства для работы с функциями', 'Свойства можно изменять, состояния нельзя', 'Свойства для работы со значениями, состояния для работы с функциями'],
        correct: 0,
    },
    {
        title: "Для чего предназначен React Router?",
        variants: ['Для управления глобальным состоянием', 'Для управления навигацией и маршрутизацией', 'Для условного рендеринга', 'Для подключения к внешним API'],
        correct: 1,
    },
    {
        title: "Какой метод отвечает за вывод информации через React JS компонент?",
        variants: ['react', 'print', 'console', 'render'],
        correct: 3,
    },
    {
        title: "От какого класса идет наследование всех компонентов?",
        variants: ['ReactComponent', 'ReactJS.Component', 'React.Component', 'ComponentReact'],
        correct: 2,
    },
    {
        title: "Что используется для передачи данных компоненту извне?",
        variants: ['setState', 'PropTypes', 'props', 'JSProperties'],
        correct: 2,
    },
    {
        title: "Какова цель пропса 'key' в списке React?",
        variants: ['Для уникальной идентификации каждого элемента', 'Для стилизации элементов', 'Для повышения производительности', 'Для вызова событий'],
        correct: 0,
    }
]